app/Libraries/Authentication.php

SELECT *
FROM `user`
WHERE `user`.`id` = '14'
---
    public function getCurrentUser(){
        if(! session()->has('user_id')){
            return null;
        }

        if($this->user === null){
            $model = new \App\Models\UserModel;

            $this->user = $model->find(session()->get('user_id'));